{"posts":[{"url":"https://borntofrappe.github.io/bien-le-bonjour","slug":"bien-le-bonjour","title":"Bien le bonjour!","brief":"There are many ways to learn something. It helps to start with the right foot","entry":2,"datetime":"2022-12-30T21:56","tags":["french","learning"],"date":"2022-12-30T21:56:00.000Z","html":"<p>One of the skills I intend to master relates to the French language. I've been reading news from continental France for quite some time, to the point where I can comprehend and even describe most articles. There is however an entire vocabulary which eludes me. Familiar dialogue. Words, expressions, perhaps less intentional than those cherry-picked for the written press, used freely, born out of instinct and the difficult to experience reality which comes from just living locally.</p>\n<p>Barring a move to a not-so-distant border, a way to tap into the vernacular is through different media. Books, movies, podcasts, streamers broadcasting their daily endeavors. And yes, games. Watching people enjoy games, through ups and downs, through the impact of a heart-felt cut-scene, through the tension and reward from a hard-fought battle.</p>\n<h2>Bon! on y va, non?</h2>\n<p>Jumping straight into a stream might work, but is similar to dive-bombing into the sea just having learnt how to dog paddle.</p>\n<p>A couple of tests lead me to believe that French people are quite fond of being quick-witted, jamming three words where you'd think only two would fit. While I do appreciate the efficiency, this tendency makes it easy to lose your bearing, even in a short conversation.</p>\n<p>It helps to have a leg up. In this instance, it helps to experience the games first-hand. In tongue, most assuredly.</p>\n<p>You might believe this a convoluted, long-winded excuse to waste more time playing games, but honestly that is a delightful added bonus.</p>\n<p>The intent is to soften a steep learning curve, much like a CSS transition eases changes with a thoughtful timing function. And what better curve than an ease-out function, starting slowly with a title I already completed in its anglophone variant?</p>\n<p>Not a better pretext than to dive back into the pixelated marvel which is Pokemon Red, err Pokemon Rouge.</p>\n<h2>Found in translation</h2>\n<p>Being a role-playing game, you can enjoy the Game Boy gem at your own pace, you are able to digest every line of dialogue with the help of a quick lookup online.</p>\n<p>Being a rather popular game, there is no shortage of material in video form.</p>\n<p>Being a game actually finished more times than I care to admit, I can personally find correspondence with the English dialogue, and enjoy the idiosyncrasies baked by the translating team as they try to adapt to the adventure to the local audience.</p>\n<p>In the exploration of the luxury cruise liner S.S. Anne in Pokemon Red, for instance, you meet a young lady confounding you for a waiter and asking for a specific sweet. On one side of the ocean this is a cherry pie, but on the opposite land the dessert becomes <em>une tarte aux poires</em>. Curious.</p>\n<p>A few steps later, in the kitchen hold of the same ship, the cook proposes one of three menus, described if you ask enough times to compensate for randomness. While the options do not change radically — prime beef steak becomes <em>cotes de boeuf</em>, eels au barbeque turns into <em>pates d'anguilles</em> and salmon du salad literally morphs into to <em>salade de saumon</em>, it is intriguing to see the comment for each entry — especially for the last, vegetable-based entree.</p>\n<p>In Shakespeare's tongue <em>Les guests may gripe it's fish again</em>. Dans la langue de Molière, on the other hand, <em>Pour ceux qui ne sont pas content, c'est la meme chose!</em>.</p>\n<p>I'll leave to you the homework of typing these words in a translator, and delight in the accompanying humor.</p>\n<p>Entertaining enough to be memorable.</p>\n"},{"url":"https://borntofrappe.github.io/pixel-art","slug":"pixel-art","title":"Pixel art","brief":"An experiment, nay an excuse, to concoct more 2D sprites","entry":1,"datetime":"2022-12-29T15:38","tags":["design","2D","spritesheet"],"date":"2022-12-29T15:38:00.000Z","html":"<p>This website has an undeniable preference for 2D sprites. Of course you won't notice this without CSS, but let's assume you are seeing the results of the stylesheet manicured just for you.</p>\n<p>Let's assume you did notice the art at the bottom of the page.</p>\n<p>Well, I've decided to tinker once more with pixel art. Not only that, I've dared to level up and go from a 8 pixel canvas to a 16 pixel one. Twice the number in each direction, four times the number of pixels.</p>\n<p>You could make a case that some of these pixels are not actually used, after all the images are in <code>.png</code> format, allowing for transparency, but you get the gist.</p>\n<p><img src=\"/images/spritesheet-16.png\" alt=\"Spritesheet with 11 sprites\"></p>\n<p>11 sprites, 16 by 16, Enough to make your head spin.</p>\n<h2>Use case</h2>\n<p>At the time of writing, there is no point to the spritesheet. There are a few leads, however. The star, moon and, let's pretend you're convinced the third sprite from the left looks like a sun, could make for a toggle between themes — not that I would implement the feature just yet.</p>\n<p>The map is perfect to describe the position in the website, and the cog right next to it might introduce a menu rather convincingly.</p>\n<p>The compass is perhaps the most versatile, for a loader, a timeout. It could use a few more frames to animate the visual, though.</p>\n<p>There are still five in the, admittedly small, sheet, but I'll let you figure out your favorite on your own — I've got my own.</p>\n"}]}