{"entries":[{"url":"https://borntofrappe.github.io/taking-a-break","slug":"taking-a-break","title":"Taking a break","date":"2023-01-15T21:23:00.000Z","description":"An immediate hiatus might be cause for concern, but here it's part of a grander design.","html":"<p>After just one entry this log takes a break. A scheduled break, bound to end in five to six days. For a very simple reason, explained in a very convoluted manner.</p>\n<h2>How this website was built</h2>\n<p><a href=\"/hello-world\">In the first post</a> I mentioned the stack behind the website:</p>\n<ol>\n<li>\n<p>the build tool <a href=\"https://kit.svelte.dev/\">SvelteKit</a></p>\n</li>\n<li>\n<p>the hosting service <a href=\"https://pages.github.com/\">GitHub Pages</a></p>\n</li>\n</ol>\n<p>You could discuss down the node packages and highlight further:</p>\n<ul>\n<li>\n<p><code>gray-matter</code> to parse YAML front matter</p>\n</li>\n<li>\n<p><code>markdown-it</code> to parse markdown into browser-friendly HTML</p>\n</li>\n<li>\n<p><code>shiki</code> to highlight code fences</p>\n</li>\n</ul>\n<p>Why the shopping list? For a very simple reason: I do not plan to write about the topic any further.</p>\n<p>This application has a landing page and a blog-like section. Fingers crossed, they both work.</p>\n<p>How the application works is beside the point. You will be thankful if you care about the actual topic, much less so if you were really interested in a detailed write-up of data fetching and Svelte syntax. At least you got a deluge of technical information early on, and a reason to stop reading already.</p>\n<h2>What is the point of this website</h2>\n<p>Games.</p>\n<p>Playing games, making games, learning how to make, and how to play?, games.</p>\n<p>I first approached game development with <a href=\"https://cs50.harvard.edu/games/2018/\">CS50 intro to game development</a>, creating clones of 2D games as well as my little own experiments <a href=\"https://github.com/borntofrappe/game-development\">with Lua and Love2D</a>.</p>\n<p>It is a topic which honestly fascinates me, a topic which unfortunately fell out of rotation as I started working on &quot;more serious&quot; applications, and a topic I plan to cover deliberately over the weekend.</p>\n<p>Hence, this entry.</p>\n<p>Therefore, the break.</p>\n<p>It is currently 22.41 of a chilly Sunday, and while I'm slowly, dangerously approaching the point of breaking the premise, I commit to a new article next Saturday, most likely with something more interesting to say. Perhaps with even something more entertaining to share.</p>\n"},{"url":"https://borntofrappe.github.io/hello-world","slug":"hello-world","title":"Hello world","date":"2023-01-15T00:00:00.000Z","description":"First of many entries? Let's be cautious, and just hope it won't be the last.","html":"<p>If you are reading this introductory post, it means this enterprise is already a success. It means I did manage to deploy a static website on <a href=\"https://pages.github.com/\">GitHub Pages</a>. An application built with <a href=\"https://kit.svelte.dev/\">SvelteKit</a>, with a spiffy landing page and a blog.</p>\n<p>That's all? In more ways than one, it currently is.</p>\n"}]}