{"type":"data","nodes":[null,{"type":"data","data":[{"url":1,"slug":2,"title":3,"brief":4,"entry":5,"datetime":6,"tags":7,"date":11,"html":12},"http:\u002F\u002Fsveltekit-prerender\u002Fpixel-art","pixel-art","Pixel art","An experiment, nay an excuse, to concoct more 2D sprites",1,"2022-12-29T15:38",[8,9,10],"design","2D","spritesheet","2022-12-29T15:38:00.000Z","\u003Cp\u003EThis website has an undeniable preference for 2D sprites. Of course you won't notice this without CSS, but let's assume you are seeing the results of the stylesheet manicured just for you.\u003C\u002Fp\u003E\n\u003Cp\u003ELet's assume you did notice the art at the bottom of the page.\u003C\u002Fp\u003E\n\u003Cp\u003EWell, I've decided to tinker once more with pixel art. Not only that, I've dared to level up and go from a 8 pixel canvas to a 16 pixel one. Twice the number in each direction, four times the number of pixels.\u003C\u002Fp\u003E\n\u003Cp\u003EYou could make a case that some of these pixels are not actually used, after all the images are in \u003Ccode\u003E.png\u003C\u002Fcode\u003E format, allowing for transparency, but you get the gist.\u003C\u002Fp\u003E\n\u003Cp\u003E\u003Cimg src=\"\u002Fimages\u002Fspritesheet-16.png\" alt=\"Spritesheet with 11 sprites\"\u003E\u003C\u002Fp\u003E\n\u003Cp\u003E11 sprites, 16 by 16, Enough to make your head spin.\u003C\u002Fp\u003E\n\u003Ch2\u003EUse case\u003C\u002Fh2\u003E\n\u003Cp\u003EAt the time of writing, there is no point to the spritesheet. There are a few leads, however. The star, moon and, let's pretend you're convinced the third sprite from the left looks like a sun, could make for a toggle between themes — not that I would implement the feature just yet.\u003C\u002Fp\u003E\n\u003Cp\u003EThe map is perfect to describe the position in the website, and the cog right next to it might introduce a menu rather convincingly.\u003C\u002Fp\u003E\n\u003Cp\u003EThe compass is perhaps the most versatile, for a loader, a timeout. It could use a few more frames to animate the visual, though.\u003C\u002Fp\u003E\n\u003Cp\u003EThere are still five in the, admittedly small, sheet, but I'll let you figure out your favorite on your own — I've got my own.\u003C\u002Fp\u003E\n"],"uses":{"params":["slug"]}}]}